-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: localhost    Database: fs_semi
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `bmap`
--

DROP TABLE IF EXISTS `bmap`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `bmap` (
  `id` int NOT NULL AUTO_INCREMENT,
  `region` varchar(20) NOT NULL,
  `brand` varchar(20) NOT NULL,
  `name` varchar(100) NOT NULL,
  `lat` double NOT NULL,
  `lng` double NOT NULL,
  `address` varchar(200) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bmap`
--

LOCK TABLES `bmap` WRITE;
/*!40000 ALTER TABLE `bmap` DISABLE KEYS */;
INSERT INTO `bmap` VALUES (1,'강남','올리브영','올리브영 역삼점',37.4987564,127.0292784,'서울시 강남구 역삼동'),(2,'강남','올리브영','올리브영 강남타운점',37.5008693,127.0256886,'서울시 서초구 서초동'),(3,'강남','올리브영','올리브영 서초타운점',37.4950072,127.0280174,'서울시 서초구 서초동'),(4,'강남','올리브영','올리브영 강남우성점',37.4918902,127.0309525,'서울시 강남구 역삼동'),(5,'강남','올리브영','올리브영 서초대로점',37.4940977,127.0158607,'서울시 서초구 서초동'),(6,'강남','올리브영','올리브영 서초우성점',37.4925811,127.0295735,'서울시 서초구 서초동'),(7,'강남','올리브영','올리브영 강남중앙점',37.4962484,127.0287983,'서울시 강남구 역삼동'),(8,'강남','올리브영','올리브영 역삼중앙점',37.5010231,127.0360826,'서울시 강남구 역삼동'),(9,'강남','올리브영','올리브영 신강남점',37.5025179,127.0264331,'서울시 강남구 역삼동'),(10,'강남','올리브영','올리브영 역삼역점',37.4996424,127.0342691,'서울시 강남구 역삼동'),(11,'강남','다이소','다이소 강남본점',37.4959528,127.029101,'서울시 강남구 역삼동'),(12,'강남','다이소','다이소 도곡점',37.4918874,127.0399974,'서울시 강남구 도곡동'),(13,'강남','다이소','다이소 강남역2호점',37.4988108,127.0289974,'서울시 강남구 역삼동'),(14,'강남','다이소','다이소 교대역점',37.4941923,127.0165987,'서울시 서초구 서초동'),(15,'강남','다이소','다이소 신논현역점',37.5043512,127.0250471,'서울시 강남구 역삼동'),(16,'성수','올리브영','올리브영 성수점',37.545293,127.0544791,'서울시 성동구 성수동2가'),(17,'성수','올리브영','올리브영N 성수',37.5441151,127.054556,'서울시 성동구 성수동2가'),(18,'성수','올리브영','올리브영 성수연방점',37.5416089,127.056905,'서울시 성동구 성수동2가'),(19,'성수','올리브영','올리브영 뚝섬역점',37.5477141,127.0452712,'서울시 성동구 성수동1가'),(20,'성수','올리브영','올리브영 서울숲역점',37.5418696,127.0449555,'서울시 성동구 성수동1가'),(21,'성수','올리브영','올리브영 건대커먼그라운드점',37.5411513,127.0659498,'서울시 광진구 자양동'),(22,'성수','다이소','다이소 뚝섬역점',37.5477545,127.0451425,'서울시 성동구 성수동1가'),(23,'성수','다이소','다이소 건대입구점',37.5408751,127.0684635,'서울시 광진구 화양동'),(24,'홍대','올리브영','올리브영 홍대정문점',37.5531465,126.9240771,'서울시 마포구 서교동'),(25,'홍대','올리브영','올리브영 홍대사거리점',37.5548763,126.9220762,'서울시 마포구 동교동'),(26,'홍대','올리브영','올리브영 홍대타운점',37.5565733,126.9243823,'서울시 마포구 동교동'),(27,'홍대','올리브영','올리브영 상수역점',37.5489633,126.9226304,'서울시 마포구 상수동'),(28,'홍대','올리브영','올리브영 광흥창역점',37.5498134,126.9314523,'서울시 마포구 상수동'),(29,'홍대','다이소','다이소 홍대2호점',37.5578486,126.9255463,'서울시 마포구 동교동'),(30,'홍대','다이소','다이소 홍대입구점',37.5544355,126.922117,'서울시 마포구 동교동'),(31,'홍대','다이소','다이소 합정동점',37.5483249,126.9172999,'서울시 마포구 동교동'),(32,'홍대','다이소','다이소 연희동점',37.5657777,126.9298108,'서울시 서대문구 연희동'),(33,'홍대','다이소','다이소 신촌명물거리점',37.55825,126.9380507,'서울시 서대문구 창천동'),(34,'홍대','다이소','다이소 신촌본점',37.5553011,126.9355299,'서울시 마포구 노고산동'),(35,'DDP','올리브영','올리브영 동대문역사문화공원역점',37.5670961,127.0080856,'서울시 중구 을지로6가'),(36,'DDP','올리브영','올리브영 현대시티아울렛동대문점',37.5689151,127.0076901,'서울시 중구 을지로6가'),(37,'DDP','올리브영','올리브영 두타점',37.5688137,127.0087526,'서울시 중구 을지로6가'),(38,'DDP','올리브영','올리브영 던던동대문점',37.5688137,127.0087526,'서울시 중구 을지로6가'),(39,'DDP','올리브영','올리브영 신당역점',37.5656991,127.0164491,'서울시 중구 흥인동'),(40,'DDP','올리브영','올리브영 제일제당센터점',37.5638908,127.0034354,'서울시 중구 쌍림동'),(41,'DDP','다이소','다이소 동대문점',37.5702861,127.0099717,'서울시 종로구 창신동'),(42,'DDP','다이소','다이소 현대시티아울렛동대문점',37.5689569,127.0078371,'서울시 중구 을지로6가'),(43,'DDP','다이소','다이소 동묘점',37.573444,127.0161243,'서울시 종로구 숭인동'),(44,'DDP','다이소','다이소 롯데던던동대문점',37.565761,127.0069912,'서울시 중구 을지로6가');
/*!40000 ALTER TABLE `bmap` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-05-21 16:58:06
